app/controllers/dashboard_controller.rb

SELECT  "search_engines".* FROM "search_engines"   ORDER BY "search_engines"."id" ASC LIMIT 1
---
   def index
    if params[:keyword]
      module_obj = V1::Googler::Scrap.new params[:engine], params[:domain], params[:keyword]
      @result = module_obj.get_keyword_position_on_100_result
      @search_engines = SearchEngine.all