app/controllers/dashboard_controller.rb

SELECT "campaigns".* FROM "campaigns"
SELECT "domains".* FROM "domains"
---
  def show
    load_variables
    @campaigns = Campaign.all
    @queries = Query.all
    @domains = Domain.all