app/controllers/domains_controller.rb

SELECT "domains".* FROM "domains"
---
  def index
    @domains = Domain.all