app/controllers/search_engines_controller.rb

SELECT "search_engines".* FROM "search_engines"
---
  def index
    @search_engines = SearchEngine.all

INSERT INTO "search_engines" ("created_at", "engine", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-11-05 03:38:55.393149"], ["engine", "https://www.google.co.in/"], ["updated_at", "2014-11-05 03:38:55.393149"]]
---
  def create
    @search_engine = SearchEngine.new(search_engine_params)

    respond_to do |format|
      if @search_engine.save

SELECT  "search_engines".* FROM "search_engines"  WHERE "search_engines"."id" = $1 LIMIT 1  [["id", 1]]
---
  def set_domain
    @search_engine = SearchEngine.find(params[:id])